app/controllers/publications_controller.rb

SELECT "publications".* FROM "publications"
---
  def index
    @title = params[:title]
    if !@title.blank?
      @publications = Publication.where(["title like ?", "%#{@title}%"])
    else
      @publications = Publication.all